
data = [
    [1,"วิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคม"],
    [2,"รองวิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคมด้านบำรุงรักษา"],
    [3,"รองวิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคมด้านโครงการพัฒนาระบบ"],
    [4,"ศูนย์บำรุงรักษาส่วนกลาง"],
    [5,"ศูนย์บำรุงรักษาส่วนภูมิภาค"],
    [6,"ศูนย์โครงการและพัฒนาระบบ"],
    [7,"ศูนย์วิชาการและโทรคมนาคม"],
    [8,"กองบริหารทั่วไป"],
    [9,"แผนกสารบรรณและประวัติ"],
    [10,"แผนกบัญชีและการเงิน"],
    [11,"แผนกจัดซื้อจัดจ้าง"],
    [12,"แผนกควบคุมพัสดุ"],
    [13,"กองอาณัติสัญญาณ"],
    [14,"กองควบคุมอาณัติสัญญาณทางไกล"],
    [15,"กองบำรักษาเขต 1"],
    [16,"กองบำรักษาเขต 2"],
    [17,"กองก่อสร้าง"],
    [18,"กองโครงการและแผนงาน"],
    [19,"กองโทรคมนาคม"],
    [20,"กองวิชาการและมาตรฐาน"],
    [21,"สารวัตรงานโรงงาน"],
    [22,"สารวัตรงานเครื่องมือกล"],
    [23,"สารวัตรงานบำรุงรักษาเครื่องปรับอากาศ"],
    [24,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงธนบุรี"],
    [25,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงอยุธยา"],
    [26,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณภาคกลาง"],
    [27,"สารวัตรงานบำรุงรักษาระบบควบคุมอาณัติสัญญาณทางไกล"],
    [28,"สารวัตรงานบำรุงรักษาตรวจสอบเครื่องกั้นทางไกล"],
    [29,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณย่านพิเศษ"],
    [30,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงแก่งคอย"],
    [31,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงลำชี"],
    [32,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงขอนแก่น"],
    [33,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงนครสวรรค์"],
    [34,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงลำปาง"],
    [35,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงหัวหิน"],
    [36,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงทุ่งสง"],
    [37,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงหาดใหญ่"],
    [38,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงฉะเชิงเทรา"],
    [39,"สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงศรีราชา"],
    [40,"สารวัตรงานระบบข่ายชุมสาย"],
    [41,"สารวัตรงานระบบไฟฟ้าแสงสว่าง"],
    [42,"สารวัตรงานระบบส่งสัญญาณโทรคมนาคม"],
    [43,"สารวัตรงานระบบเสาสาย"],
    [44,"สารวัตรงานระบบวิทยุ"],
    [45,"สารวัตรงานวิชาการและอบรม"],
    [46,"สารวัตรงานมาตรฐานและตรวจสอบ"],
    [47,"สารวัตรงานวิจัยและสถิติ"],
    [48,"สารวัตรงานซ่อมบำรุงอิเล็กทรอนิกส์"],
    [49,"นายตรวจสายตอนช่องแค"],
    [50,"พนักงานเทคนิค 5 ที่ชค."],
    [51,"ช่างฝีมือ 4 ที่ ชค."],
    [52,"นายตรวจสายตอนนครสวรรค์"],
    [53,"ช่างฝีมือ 6 ที่ นว."],
    [54,"พนักงานเทคนิค 5 ที่ นว."],
    [55,"นายตรวจสายนครสวรรค์ ที่ตะพานหิน"],
    [56,"พนักงานเทคนิค 5 นว. ที่ตห."],
    [57,"ช่างฝีมือ 4 นว.ที่ ตห."]
]

def addChild(children, parent):
    # Add Current Position
    TreePaths.append([children, children, 0])
    for _ancestor, _descendant, _path_length in TreePaths:
        if (_descendant == parent):
            TreePaths.append([_ancestor, children, _path_length+1])

# print(TreePaths)

# addChild(5, 1)
# addChild(7, 1)
# print(TreePaths)
# addChild(4, 5)
# print(TreePaths)
# addChild(3, 4)
# print(TreePaths)

# print(len(data))
# for i in data:
#     print(i)


TreePaths = [[1, 1, 0]] # วิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคม
addChild(2, 1) # รองวิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคมด้านบำรุงรักษา
addChild(3, 1) # รองวิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคมด้านโครงการพัฒนาระบบ
addChild(4, 2) # ศูนย์บำรุงรักษาส่วนกลาง
addChild(5, 2) # ศูนย์บำรุงรักษาส่วนภูมิภาค
addChild(6, 3) # ศูนย์โครงการและพัฒนาระบบ
addChild(7, 3) # ศูนย์วิชาการและโทรคมนาคม
addChild(8, 1) # กองบริหารทั่วไป
# แผนกสารบรรณและประวัติ & แผนกบัญชีและการเงิน
addChild(9, 8)
addChild(10, 8)
# แผนกจัดซื้อจัดจ้าง & แผนกควบคุมพัสดุ
addChild(11, 8)
addChild(12, 8)
# กองอาณัติสัญญาณ & กองควบคุมอาณัติสัญญาณทางไกล
addChild(13, 4)
addChild(14, 4)
# กองบำรักษาเขต 1 & กองบำรักษาเขต 2
addChild(15, 5)
addChild(16, 5)
# กองก่อสร้าง & กองโครงการและแผนงาน
addChild(17, 6)
addChild(18, 6)
# กองโทรคมนาคม & กองวิชาการและมาตรฐาน
addChild(19, 7)
addChild(20, 7)

# กองอาณัติสัญญาณ
addChild(21, 13)
addChild(22, 13)
addChild(23, 13)
addChild(24, 13)
addChild(25, 13)
addChild(26, 13)

# กองควบคุมอาณัติสัญญาณทางไกล
addChild(27, 14)
addChild(28, 14)
addChild(29, 14)

# กองบำรักษาเขต 1
addChild(30, 15)
addChild(31, 15)
addChild(32, 15)
addChild(33, 15)
addChild(34, 15)

# กองบำรักษาเขต 2
addChild(35, 16)
addChild(36, 16)
addChild(37, 16)
addChild(38, 16)
addChild(39, 16)

# กองโทรคมนาคม
addChild(40, 19)
addChild(41, 19)
addChild(42, 19)
addChild(43, 19)
addChild(44, 19)

# กองวิชาการและมาตรฐาน
addChild(45, 20)
addChild(46, 20)
addChild(47, 20)
addChild(48, 20)

# สารวัตรงานบำรุงรักษาอาณัติสัญญาณแขวงนครสวรรค์
addChild(49, 33) # นายตรวจสายตอนช่องแค
addChild(50, 49) # พนักงานเทคนิค 5 ที่ชค.
addChild(51, 50) # ช่างฝีมือ 4 ที่ ชค.

addChild(52, 33) # นายตรวจสายตอนนครสวรรค์
addChild(53, 52) # ช่างฝีมือ 6 ที่ นว.
addChild(54, 53) # พนักงานเทคนิค 5 ที่ นว.

addChild(55, 33) # นายตรวจสายนครสวรรค์ ที่ตะพานหิน
addChild(56, 55) # พนักงานเทคนิค 5 นว. ที่ตห.
addChild(57, 56) # ช่างฝีมือ 4 นว.ที่ ตห.

# print(len(TreePaths))

for data in TreePaths:
    print(f'{data[0]},{data[1]},{data[2]}')























# import json


# def has_children(obj_hierarchy):
#     '''
#     Function for check it has children ?
#     Input: 
#         obj_hierarchy:
#     Output:
#         obj_hierarchy['children']
#     '''
#     if "children" in obj_hierarchy:
#         print("has_children",obj_hierarchy['name'])
#         return obj_hierarchy['children']
#     return []


# # Read JSON File
# with open('/workdir/position_hierarchy.json') as f:
#     position_hierarchy_obj = json.load(f)

# count = 0
# print("ROOT -->", position_hierarchy_obj['name'])
# for posi_child in position_hierarchy_obj['children']:
#     print(">", posi_child['name'])
#     if "children" in posi_child:
#         for posi in position_hierarchy_obj:
#             print("In children", posi_child['children'])
#             has_children(posi_child['children'])
#     else:
#         print("Out children", posi_child['name'])
    
#     # if position_hierarchy_obj['children'] != 
#     # print(count)
#     # if count == 1:
#     #     break
#     # count = count + 1
