
data = [
    [1, "วิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคม"],
    [2, "รองวิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคมด้านบำรุงรักษา"],
    [3, "รองวิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคมด้านโครงการพัฒนาระบบ"],
    [4, "ศูนย์บำรุงรักษาส่วนกลาง"],
    [5, "ศูนย์บำรุงรักษาส่วนภูมิภาค"],
    [6, "ศูนย์โครงการและพัฒนาระบบ"],
    [7, "ศูนย์วิชาการและโทรคมนาคม"],
    [8, "กองบริหารทั่วไป"],
    [9, "แผนกควบคุมพัสดุ"],
    [10, "กองอาณัติสัญญาณ"],
    [11, "กองควบคุมอาณัติสัญญาณทางไกล"],
    [12, "กองบำรักษาเขต 1"],
    [13, "กองบำรักษาเขต 2"],
    [14, "กองก่อสร้าง"],
    [15, "กองโครงการและแผนงาน"],
    [16, "กองโทรคมนาคม"],
    [17, "กองวิชาการและมาตรฐาน"],
    [18, "สารวัตรงานโรงงาน"],
    [19, "สารวัตรงานเครื่องมือกล"],
    [20, "สารวัตรงานเครื่องปรับอากาศ"],
    [21, "สารวัตรแขวงธนบุรี"],
    [22, "สารวัตรแขวงอยุธยา"],
    [23, "สารวัตรภาคกลาง"],
    [24, "สารวัตรระบบควบคุมทางไกล"],
    [25, "สารวัตรตรวจสอบเครื่องกั้นทางไกล"],
    [26, "สารวัตรย่านพิเศษ"],
    [27, "สารวัตรแขวงแก่งคอย"],
    [28, "สารวัตรแขวงลำชี"],
    [29, "สารวัตรแขวงขอนแก่น"],
    [30, "สารวัตรแขวงนครสวรรค์"],
    [31, "สารวัตรแขวงลำปาง"],
    [32, "สารวัตรแขวงหัวหิน"],
    [33, "สารวัตรแขวงทุ่งสง"],
    [34, "สารวัตรแขวงหาดใหญ่"],
    [35, "สารวัตรแขวงฉะเชิงเทรา"],
    [36, "สารวัตรแขวงศรีราชา"],
    [37, "สารวัตรงานระบบข่ายชุมสาย"],
    [38, "สารวัตรงานระบบไฟฟ้าแสงสว่าง"],
    [39, "สารวัตรงานระบบส่งสัญญาณโทรคมนาคม"],
    [40, "สารวัตรงานระบบเสาสาย"],
    [41, "สารวัตรงานระบบวิทยุ"],
    [42, "สารวัตรงานวิชาการและอบรม"],
    [43, "สารวัตรงานมาตรฐานและตรวจสอบ"],
    [44, "สารวัตรงานวิจัยและสถิติ"],
    [45, "สารวัตรงานซ่อมบำรุงอิเล็กทรอนิกส์"],
    [46, "นายตรวจสายธนบุรี"],
    [47, "นายตรวจสายตลิ่งชัน"],
    [48, "นายตรวจสายนครปฐม"],
    [49, "นายตรวจสายกาญจนบุรี"],
    [50, "นายตรวจสายบ้านโป่ง"],
    [51, "นายตรวจสายกรุงเทพ"],
    [52, "นายตรวจสายจิตรลดา"],
    [53, "นายตรวจสายบางซื่อ"],
    [54, "นายตรวจสายอยุธยา"],
    [55, "นายตรวจสายบ้านภาชี"],
    [56, "นายตรวจสายบ้านหมอ"],
    [57, "นายตรวจสายลพบุรี"],
    [58, "นายตรวจสายมักกะสัน"],
    [59, "นายตรวจสายรังสิต"],
    [60, "นายตรวจสายแก่งคอย"],
    [61, "นายตรวจสายปากช่อง"],
    [62, "นายตรวจสายนครราชสีมา"],
    [63, "นายตรวจสายจิระที่ราชสีมา"],
    [64, "นายตรวจสายจิระที่ลำปลายมาศ"],
    [65, "นายตรวจสายลำชี"],
    [66, "นายตรวจสายตอนลำชีที่อุบลราชธานี"],
    [67, "นายตรวจสายลำนารายณ์"],
    [68, "นายตรวจสายลำนารายณ์ที่จตุรัส"],
    [69, "นายตรวจสายลำนารายณ์ที่บัวใหญ่"],
    [70, "นายตรวจสายขอนแก่น"],
    [71, "นายตรวจสายขอนแก่นที่อุดรธานี"],
    [72, "นายตรวจสายขอนแก่นที่หนองคาย"],
    [73, "นายตรวจสายช่องแค"],
    [74, "นายตรวจสายนครสวรรค์"],
    [75, "นายตรวจสายนครสวรรค์ที่ตะพานหิน"],
    [76, "นายตรวจสายพิษณุโลก"],
    [77, "นายตรวจสายพิษณุโลกที่บ้านดารา"],
    [78, "นายตรวจสายลำปาง"],
    [79, "นายตรวจสายลำปางที่บ้านปิน"],
    [80, "นายตรวจสายลำปางที่เชียงใหม่"],
    [81, "นายตรวจสายศิลาอาสน์"],
    [82, "นายตรวจสายศิลาอาสน์ที่เด่นชัย"],
    [83, "นายตรวจสายเพชรบุรี"],
    [84, "นายตรวจสายหัวหินที่ประจวบฯ"],
    [85, "นายตรวจสายชุมพรที่บางสะพานใหญ่"],
    [86, "นายตรวจสายชุมพร"],
    [87, "นายตรวจสายทุ่งสง"],
    [88, "นายตรวจสายทุ่งสงที่สุราษฏร์ธานี"],
    [89, "นายตรวจสายสุราษฏร์ธานี"],
    [90, "นายตรวจสายสุราษฏร์ธานีที่หลังสวน"],
    [91, "นายตรวจสายสุราษฏร์ธานีที่ท่าชนะ"],
    [92, "นายตรวจสายเขาชุมทองที่ทุ่งสง"],
    [93, "นายตรวจสายหาดใหญ่"],
    [94, "นายตรวจสายหาดใหญ่ที่พัทลุง"],
    [95, "นายตรวจสายรือเสาะที่ยะลา"],
    [96, "นายตรวจสายยะลาที่สุไหงโกลก"],
    [97, "นายตรวจสายฉะเชิงเทรา"],
    [98, "นายตรวจสายปราจีนบุรี"],
    [99, "นายตรวจสายปราจีนบุรีที่อรัญประเทศ"],
    [100, "นายตรวจสายองครักษ์"],
    [101, "นายตรวจสายองครักษ์ที่คลองสืเก้า"],
    [102, "นายตรวจสายศรีราชาที่ชลบุรี"],
    [103, "นายตรวจสายศรีราชา"],
    [104, "นายตรวจสายพลูตาหลวงที่บางละมุง"],
    [105, "นายตรวจสายพลูตาหลวง"],
    [106, "นายตรวจสายหัวหิน"],
    [107, "นายตรวจสายสุราษฏร์ธานีที่ชุมพร"],
    [108, "เจ้าหน้าที่ธนบุรี"],
    [109, "เจ้าหน้าที่ตลิ่งชัน"],
    [110, "เจ้าหน้าที่นครปฐม"],
    [111, "เจ้าหน้าที่กาญจนบุรี"],
    [112, "เจ้าหน้าที่บ้านโป่ง"],
    [113, "เจ้าหน้าที่กรุงเทพ"],
    [114, "เจ้าหน้าที่จิตรลดา"],
    [115, "เจ้าหน้าที่บางซื่อ"],
    [116, "เจ้าหน้าที่อยุธยา"],
    [117, "เจ้าหน้าที่บ้านภาชี"],
    [118, "เจ้าหน้าที่บ้านหมอ"],
    [119, "เจ้าหน้าที่ลพบุรี"],
    [120, "เจ้าหน้าที่มักกะสัน"],
    [121, "เจ้าหน้าที่รังสิต"],
    [122, "เจ้าหน้าที่แก่งคอย"],
    [123, "เจ้าหน้าที่ปากช่อง"],
    [124, "เจ้าหน้าที่นครราชสีมา"],
    [125, "เจ้าหน้าที่จิระที่ราชสีมา"],
    [126, "เจ้าหน้าที่จิระที่ลำปลายมาศ"],
    [127, "เจ้าหน้าที่ลำชี"],
    [128, "เจ้าหน้าที่ตอนลำชีที่อุบลราชธานี"],
    [129, "เจ้าหน้าที่ลำนารายณ์"],
    [130, "เจ้าหน้าที่ลำนารายณ์ที่จตุรัส"],
    [131, "เจ้าหน้าที่ลำนารายณ์ที่บัวใหญ่"],
    [132, "เจ้าหน้าที่ขอนแก่น"],
    [133, "เจ้าหน้าที่ขอนแก่นที่อุดรธานี"],
    [134, "เจ้าหน้าที่ขอนแก่นที่หนองคาย"],
    [135, "เจ้าหน้าที่ช่องแค"],
    [136, "เจ้าหน้าที่นครสวรรค์"],
    [137, "เจ้าหน้าที่นครสวรรค์ที่ตะพานหิน"],
    [138, "เจ้าหน้าที่พิษณุโลก"],
    [139, "เจ้าหน้าที่พิษณุโลกที่บ้านดารา"],
    [140, "เจ้าหน้าที่ลำปาง"],
    [141, "เจ้าหน้าที่ลำปางที่บ้านปิน"],
    [142, "เจ้าหน้าที่ลำปางที่เชียงใหม่"],
    [143, "เจ้าหน้าที่ศิลาอาสน์"],
    [144, "เจ้าหน้าที่ศิลาอาสน์ที่เด่นชัย"],
    [145, "เจ้าหน้าที่เพชรบุรี"],
    [146, "เจ้าหน้าที่หัวหินที่ประจวบฯ"],
    [147, "เจ้าหน้าที่ชุมพรที่บางสะพานใหญ่"],
    [148, "เจ้าหน้าที่ชุมพร"],
    [149, "เจ้าหน้าที่ทุ่งสง"],
    [150, "เจ้าหน้าที่ทุ่งสงที่สุราษฏร์ธานี"],
    [151, "เจ้าหน้าที่สุราษฏร์ธานี"],
    [152, "เจ้าหน้าที่สุราษฏร์ธานีที่หลังสวน"],
    [153, "เจ้าหน้าที่สุราษฏร์ธานีที่ท่าชนะ"],
    [154, "เจ้าหน้าที่เขาชุมทองที่ทุ่งสง"],
    [155, "เจ้าหน้าที่หาดใหญ่"],
    [156, "เจ้าหน้าที่หาดใหญ่ที่พัทลุง"],
    [157, "เจ้าหน้าที่รือเสาะที่ยะลา"],
    [158, "เจ้าหน้าที่ยะลาที่สุไหงโกลก"],
    [159, "เจ้าหน้าที่ฉะเชิงเทรา"],
    [160, "เจ้าหน้าที่ปราจีนบุรี"],
    [161, "เจ้าหน้าที่ปราจีนบุรีที่อรัญประเทศ"],
    [162, "เจ้าหน้าที่องครักษ์"],
    [163, "เจ้าหน้าที่องครักษ์ที่คลองสืเก้า"],
    [164, "เจ้าหน้าที่ศรีราชาที่ชลบุรี"],
    [165, "เจ้าหน้าที่ศรีราชา"],
    [166, "เจ้าหน้าที่พลูตาหลวงที่บางละมุง"],
    [167, "เจ้าหน้าที่พลูตาหลวง"],
    [168, "เจ้าหน้าที่หัวหิน"],
    [169, "เจ้าหน้าที่สุราษฏร์ธานีที่ชุมพร"],
    [170, "เจ้าหน้าที่คลังกลางบางซื่อ"],
    [171, "เจ้าหน้าที่ระบบข่ายชุมสาย"],
    [172, "เจ้าหน้าที่ระบบไฟฟ้าแสงสว่าง"],
    [173, "เจ้าหน้าที่ระบบส่งสัญญาณโทรคมนาคม"],
    [174, "เจ้าหน้าที่ระบบเสาสาย"],
    [175, "เจ้าหน้าที่ระบบวิทยุ"],
    [176, "เจ้าหน้าที่งานวิชาการและอบรม"],
    [177, "เจ้าหน้าที่งานมาตรฐานและตรวจสอบ"],
    [178, "เจ้าหน้าที่งานวิจัยและสถิติ"],
    [179, "เจ้าหน้าที่งานซ่อมบำรุงอิเล็กทรอนิกส์"],
    [180, "เจ้าหน้าที่งานโรงงาน"],
    [181, "เจ้าหน้าที่งานระบบเครื่องมือกล"],
    [182, "เจ้าหน้าที่งานระบบเครื่องปรับอากาศ"],
    [183, "เจ้าหน้าที่ระบบควบคุมทางไกล"],
    [184, "เจ้าหน้าที่ตรวจสอบเครื่องกั้นทางไกล"],
    [185, "เจ้าหน้าที่ย่านพิเศษ"]
]

def addChild(children, parent):
    # Add Current Position
    TreePaths.append([children, children, 0])
    for _ancestor, _descendant, _path_length in TreePaths:
        if (_descendant == parent):
            TreePaths.append([_ancestor, children, _path_length+1])

TreePaths = [[1, 1, 0]] # วิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคม
addChild(2, 1) # รองวิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคมด้านบำรุงรักษา
addChild(3, 1) # รองวิศวกรใหญ่ฝ่ายอาณัติสัญญาณและโทรคมนาคมด้านโครงการพัฒนาระบบ
addChild(4, 2) # ศูนย์บำรุงรักษาส่วนกลาง
addChild(5, 2) # ศูนย์บำรุงรักษาส่วนภูมิภาค
addChild(6, 3) # ศูนย์โครงการและพัฒนาระบบ
addChild(7, 3) # ศูนย์วิชาการและโทรคมนาคม
addChild(8, 1) # กองบริหารทั่วไป
# กองบริหารทั่วไป = [แผนกควบคุมพัสดุ]
addChild(9, 8)
# แผนกควบคุมพัสดุ = [เจ้าหน้าที่คลังกลางบางซื่อ]
addChild(170, 9)

# ศูนย์บำรุงรักษาส่วนกลาง = [กองอาณัติสัญญาณ & กองควบคุมอาณัติสัญญาณทางไกล]
addChild(10, 4)
addChild(11, 4)

# ศูนย์บำรุงรักษาส่วนภูมิภาค = [กองบำรักษาเขต 1 & กองบำรักษาเขต 2]
addChild(12, 5)
addChild(13, 5)

# ศูนย์โครงการและพัฒนาระบบ = [กองก่อสร้าง & กองโครงการและแผนงาน]
addChild(14, 6)
addChild(15, 6)

# ศูนย์วิชาการและโทรคมนาคม = [กองโทรคมนาคม & กองวิชาการและมาตรฐาน]
addChild(16, 7)
addChild(17, 7)

# กองอาณัติสัญญาณ = [สารวัตรงานโรงงาน & สารวัตรงานเครื่องมือกล & สารวัตรงานเครื่องปรับอากาศ & สารวัตรแขวงธนบุรี & สารวัตรแขวงอยุธยา & สารวัตรภาคกลาง]
addChild(18, 10)
addChild(19, 10)
addChild(20, 10)
addChild(21, 10)
addChild(22, 10)
addChild(23, 10)

# กองควบคุมอาณัติสัญญาณทางไกล = [สารวัตรระบบควบคุมทางไกล & สารวัตรตรวจสอบเครื่องกั้นทางไกล & สารวัตรย่านพิเศษ]
addChild(24, 11)
addChild(25, 11)
addChild(26, 11)

# กองบำรักษาเขต 1 = [สารวัตรแขวงแก่งคอย & สารวัตรแขวงลำชี & สารวัตรแขวงขอนแก่น & สารวัตรแขวงนครสวรรค์ & สารวัตรแขวงลำปาง]
addChild(27, 12)
addChild(28, 12)
addChild(29, 12)
addChild(30, 12)
addChild(31, 12)

# กองบำรักษาเขต 2 = [สารวัตรแขวงหัวหิน & สารวัตรแขวงทุ่งสง & สารวัตรแขวงหาดใหญ่ & สารวัตรแขวงฉะเชิงเทรา & สารวัตรแขวงศรีราชา]
addChild(32, 13)
addChild(33, 13)
addChild(34, 13)
addChild(35, 13)
addChild(36, 13)

# กองโทรคมนาคม = [สารวัตรงานระบบข่ายชุมสาย & สารวัตรงานระบบไฟฟ้าแสงสว่าง & สารวัตรงานระบบส่งสัญญาณโทรคมนาคม &สารวัตรงานระบบเสาสาย & สารวัตรงานระบบวิทยุ]
addChild(37, 16)
addChild(38, 16)
addChild(39, 16)
addChild(40, 16)
addChild(41, 16)

# กองวิชาการและมาตรฐาน = [สารวัตรงานวิชาการและอบรม & สารวัตรงานมาตรฐานและตรวจสอบ & สารวัตรงานวิจัยและสถิติ &สารวัตรงานระบบเสาสาย & สารวัตรงานซ่อมบำรุงอิเล็กทรอนิกส์]
addChild(42, 17)
addChild(43, 17)
addChild(44, 17)
addChild(45, 17)

# นายตรวจสายธนบุรี = [เจ้าหน้าที่ธนบุรี]
addChild(108, 46)

# นายตรวจสายตลิ่งชัน = [เจ้าหน้าที่ธนบุรี]
addChild(109, 47)

# นายตรวจสายตลิ่งชัน = [เจ้าหน้าที่นครปฐม]
addChild(110, 48)

# นายตรวจสายกาญจนบุรี = [เจ้าหน้าที่กาญจนบุรี]
addChild(111, 49)

# นายตรวจสายบ้านโป่ง = [เจ้าหน้าที่บ้านโป่ง]
addChild(112, 50)

# นายตรวจสายกรุงเทพ = [เจ้าหน้าที่กรุงเทพ]
addChild(113, 51)

# นายตรวจสายจิตรลดา = [เจ้าหน้าที่จิตรลดา]
addChild(114, 52)

# นายตรวจสายบางซื่อ = [เจ้าหน้าที่บางซื่อ]
addChild(115, 53)

# นายตรวจสายอยุธยา = [เจ้าหน้าที่อยุธยา]
addChild(116, 54)

# นายตรวจสายบ้านภาชี = [เจ้าหน้าที่บ้านภาชี]
addChild(117, 55)

# นายตรวจสายบ้านหมอ = [เจ้าหน้าที่บ้านหมอ]
addChild(118, 56)

# นายตรวจสายลพบุรี = [เจ้าหน้าที่ลพบุรี]
addChild(119, 57)

# นายตรวจสายมักกะสัน = [เจ้าหน้าที่มักกะสัน]
addChild(120, 58)

# นายตรวจสายรังสิต = [เจ้าหน้าที่รังสิต]
addChild(121, 59)

# นายตรวจสายแก่งคอย = [เจ้าหน้าที่แก่งคอย]
addChild(122, 60)

# นายตรวจสายปากช่อง = [เจ้าหน้าที่ปากช่อง]
addChild(123, 61)

# นายตรวจสายนครราชสีมา = [เจ้าหน้าที่นครราชสีมา]
addChild(124, 62)

# นายตรวจสายจิระที่ราชสีมา = [เจ้าหน้าที่จิระที่ราชสีมา]
addChild(125, 63)

# นายตรวจสายจิระที่ลำปลายมาศ = [เจ้าหน้าที่จิระที่ลำปลายมาศ]
addChild(126, 64)

# นายตรวจสายลำชี = [เจ้าหน้าที่ลำชี]
addChild(127, 65)

# นายตรวจสายตอนลำชีที่อุบลราชธานี = [เจ้าหน้าที่ตอนลำชีที่อุบลราชธานี]
addChild(128, 66)

# นายตรวจสายลำนารายณ์ = [เจ้าหน้าที่ลำนารายณ์]
addChild(129, 67)

# นายตรวจสายลำนารายณ์ที่จตุรัส = [เจ้าหน้าที่ลำนารายณ์ที่จตุรัส]
addChild(130, 68)

# นายตรวจสายลำนารายณ์ที่บัวใหญ่ = [เจ้าหน้าที่ลำนารายณ์ที่บัวใหญ่]
addChild(131, 69)

# นายตรวจสายขอนแก่น = [เจ้าหน้าที่ขอนแก่น]
addChild(132, 70)

# นายตรวจสายขอนแก่นที่อุดรธานี = [เจ้าหน้าที่ขอนแก่นที่อุดรธานี]
addChild(133, 71)

# นายตรวจสายขอนแก่นที่หนองคาย = [เจ้าหน้าที่ขอนแก่นที่หนองคาย]
addChild(134, 72)

# นายตรวจสายช่องแค = [เจ้าหน้าที่ช่องแค]
addChild(135, 73)

# นายตรวจสายนครสวรรค์ = [เจ้าหน้าที่นครสวรรค์]
addChild(136, 74)

# นายตรวจสายนครสวรรค์ที่ตะพานหิน = [เจ้าหน้าที่นครสวรรค์ที่ตะพานหิน]
addChild(137, 75)

# นายตรวจสายพิษณุโลก = [เจ้าหน้าที่พิษณุโลก]
addChild(138, 76)

# นายตรวจสายพิษณุโลกที่บ้านดารา = [เจ้าหน้าที่พิษณุโลกที่บ้านดารา]
addChild(139, 77)

# นายตรวจสายลำปาง = [เจ้าหน้าที่ลำปาง]
addChild(140, 78)

# นายตรวจสายลำปางที่บ้านปิน = [เจ้าหน้าที่ลำปางที่บ้านปิน]
addChild(141, 79)

# นายตรวจสายลำปางที่เชียงใหม่ = [เจ้าหน้าที่ลำปางที่เชียงใหม่]
addChild(142, 80)

# นายตรวจสายศิลาอาสน์ = [เจ้าหน้าที่ศิลาอาสน์]
addChild(143, 81)

# นายตรวจสายศิลาอาสน์ที่เด่นชัย = [เจ้าหน้าที่ศิลาอาสน์ที่เด่นชัย]
addChild(144, 82)

# นายตรวจสายเพชรบุรี = [เจ้าหน้าที่เพชรบุรี]
addChild(145, 83)

# นายตรวจสายหัวหินที่ประจวบฯ = [เจ้าหน้าที่หัวหินที่ประจวบฯ]
addChild(146, 84)

# นายตรวจสายชุมพรที่บางสะพานใหญ่ = [เจ้าหน้าที่ชุมพรที่บางสะพานใหญ่]
addChild(147, 85)

# นายตรวจสายชุมพร = [เจ้าหน้าที่ชุมพร]
addChild(148, 86)

# นายตรวจสายทุ่งสง = [เจ้าหน้าที่ทุ่งสง]
addChild(149, 87)

# นายตรวจสายทุ่งสงที่สุราษฏร์ธานี = [เจ้าหน้าที่ทุ่งสงที่สุราษฏร์ธานี]
addChild(150, 88)

# นายตรวจสายสุราษฏร์ธานี = [เจ้าหน้าที่สุราษฏร์ธานี]
addChild(151, 89)

# นายตรวจสายสุราษฏร์ธานีที่หลังสวน = [เจ้าหน้าที่สุราษฏร์ธานีที่หลังสวน]
addChild(152, 90)

# นายตรวจสายสุราษฏร์ธานีที่ท่าชนะ = [เจ้าหน้าที่สุราษฏร์ธานีที่ท่าชนะ]
addChild(153, 91)

# นายตรวจสายเขาชุมทองที่ทุ่งสง = [เจ้าหน้าที่เขาชุมทองที่ทุ่งสง]
addChild(154, 92)

# นายตรวจสายหาดใหญ่ = [เจ้าหน้าที่หาดใหญ่]
addChild(155, 93)

# นายตรวจสายหาดใหญ่ที่พัทลุง = [เจ้าหน้าที่หาดใหญ่ที่พัทลุง]
addChild(156, 94)

# นายตรวจสายรือเสาะที่ยะลา = [เจ้าหน้าที่รือเสาะที่ยะลา]
addChild(157, 95)

# นายตรวจสายยะลาที่สุไหงโกลก = [เจ้าหน้าที่ยะลาที่สุไหงโกลก]
addChild(158, 96)

# นายตรวจสายฉะเชิงเทรา = [เจ้าหน้าที่ฉะเชิงเทรา]
addChild(159, 97)

# นายตรวจสายปราจีนบุรี = [เจ้าหน้าที่ปราจีนบุรี]
addChild(160, 98)

# นายตรวจสายปราจีนบุรีที่อรัญประเทศ = [เจ้าหน้าที่ปราจีนบุรีที่อรัญประเทศ]
addChild(161, 99)

# นายตรวจสายองครักษ์ = [เจ้าหน้าที่องครักษ์]
addChild(162, 100)

# นายตรวจสายองครักษ์ที่คลองสืเก้า = [เจ้าหน้าที่องครักษ์ที่คลองสืเก้า]
addChild(163, 101)

# นายตรวจสายศรีราชาที่ชลบุรี = [เจ้าหน้าที่ศรีราชาที่ชลบุรี]
addChild(164, 102)

# นายตรวจสายศรีราชา = [เจ้าหน้าที่ศรีราชา]
addChild(165, 103)

# นายตรวจสายพลูตาหลวงที่บางละมุง = [เจ้าหน้าที่พลูตาหลวงที่บางละมุง]
addChild(166, 104)

# นายตรวจสายพลูตาหลวง = [เจ้าหน้าที่พลูตาหลวง]
addChild(167, 105)

# นายตรวจสายหัวหิน = [เจ้าหน้าที่หัวหิน]
addChild(168, 106)

# นายตรวจสายสุราษฏร์ธานีที่ชุมพร = [เจ้าหน้าที่สุราษฏร์ธานีที่ชุมพร]
addChild(169, 107)

# ระบบข่ายชุมสาย
addChild(171, 37)

# ระบบไฟฟ้าแสงสว่าง
addChild(172, 38)

# ระบบส่งสัญญาณโทรคมนาคม
addChild(173, 39)

# ระบบเสาสาย
addChild(174, 40)

# ระบบวิทยุ
addChild(175, 41)

# งานวิชาการและอบรม
addChild(176, 42)

# งานมาตรฐานและตรวจสอบ
addChild(177, 43)

# งานวิจัยและสถิติ
addChild(178, 44)

# งานซ่อมบำรุงอิเล็กทรอนิกส์
addChild(179, 45)

# งานโรงงาน
addChild(180, 18)

# งานระบบเครื่องมือกล
addChild(181, 19)

# งานระบบเครื่องปรับอากาศ
addChild(182, 20)

# ระบบควบคุมทางไกล
addChild(183, 24)

# ตรวจสอบเครื่องกั้นทางไกล
addChild(184, 25)

# ย่านพิเศษ
addChild(185, 26)

# สารวัตรแขวงธนบุรี = [ธนบุรี & ตลิ่งชัน & นครปฐม & กาญจนบุรี & บ้านโป่ง]
addChild(46, 21)
addChild(47, 21)
addChild(48, 21)
addChild(49, 21)
addChild(50, 21)

# สารวัตรแขวงอยุธยา = [อยุธยา & บ้านภาชี & บ้านหมอ & ลพบุรี]
addChild(54, 22)
addChild(55, 22)
addChild(56, 22)
addChild(57, 22)

# สารวัตรภาคกลาง = [กรุงเทพ & จิตรลดา & บางซื่อ]
addChild(51, 23)
addChild(52, 23)
addChild(53, 23)

# สารวัตรระบบควบคุมทางไกล = [] // Not have

# สารวัตรตรวจสอบเครื่องกั้นทางไกล = [] // Not have

# สารวัตรย่านพิเศษ = [นายตรวจสายมักกะสัน & นายตรวจสายรังสิต]
addChild(58, 26)
addChild(59, 26)
addChild(120, 26)
addChild(121, 26)

# สารวัตรแขวงแก่งคอย = [นายตรวจสายแก่งคอย & นายตรวจสายปากช่อง & นายตรวจสายนครราชสีมา]
addChild(60, 27)
addChild(122, 27)
addChild(61, 27)
addChild(123, 27)
addChild(62, 27)
addChild(124, 27)

# สารวัตรแขวงลำชี = [จิระที่ราชสีมา & จิระที่ลำปลายมาศ & ลำชี & ลำชีที่อุบลราชธานี]
addChild(63, 28)
addChild(125, 28)
addChild(64, 28)
addChild(126, 28)
addChild(65, 28)
addChild(127, 28)
addChild(66, 28)
addChild(128, 28)

# สารวัตรแขวงขอนแก่น = [ตอนลำนารายณ์ & ตอนลำนารายณ์ที่จตุรัส & ตอนลำนารายณ์ที่บัวใหญ่ & ตอนขอนแก่น & ตอนขอนแก่นที่อุดรธานี & ตอนขอนแก่นที่หนองคาย]
addChild(67, 29)
addChild(129, 29)
addChild(68, 29)
addChild(130, 29)
addChild(69, 29)
addChild(131, 29)
addChild(70, 29)
addChild(132, 29)
addChild(71, 29)
addChild(133, 29)
addChild(72, 29)
addChild(134, 29)


# สารวัตรแขวงนครสวรรค์ = [ตอนช่องแค & ตอนนครสวรรค์ & ตอนนครสวรรค์ที่ตะพานหิน & ตอนพิษณุโลก & ตอนพิษณุโลกที่บ้านดารา]
addChild(73, 30)
addChild(135, 30)
addChild(74, 30)
addChild(136, 30)
addChild(75, 30)
addChild(137, 30)
addChild(76, 30)
addChild(138, 30)
addChild(77, 30)
addChild(139, 30)

# สารวัตรแขวงลำปาง = [ตอนลำปาง & ตอนลำปางที่บ้านปิน & ตอนลำปางที่เชียงใหม่ & ตอนศิลาอาสน์ & ตอนศิลาอาสน์ที่เด่นชัย]
addChild(78, 31)
addChild(140, 31)
addChild(79, 31)
addChild(141, 31)
addChild(80, 31)
addChild(142, 31)
addChild(81, 31)
addChild(143, 31)
addChild(82, 31)
addChild(144, 31)

# สารวัตรแขวงหัวหิน = [ตอนเพชรบุรี & ตอนหัวหิน & ตอนหัวหินที่ประจวบฯ & ตอนชุมพรที่บางสะพานใหญ่ & ตอนชุมพร]
addChild(83, 32)
addChild(145, 32)
addChild(106, 32)
addChild(168, 32)
addChild(84, 32)
addChild(146, 32)
addChild(85, 32)
addChild(147, 32)
addChild(86, 32)
addChild(148, 32)

# สารวัตรแขวงทุ่งสง = [ตอนทุ่งสง & ตอนทุ่งสงที่สุราษฏร์ธานี & ตอนสุราษฏร์ธานีที่ชุมพร & ตอนสุราษฏร์ธานี & ตอนสุราษฎร์ธานีที่หลังสวน & ตอนสุราษฎร์ธานีที่ท่าชนะ & ตอนเขาชุมทองที่ทุ่งสง]
addChild(87, 33)
addChild(149, 33)
addChild(88, 33)
addChild(150, 33)
addChild(107, 33)
addChild(169, 33)
addChild(89, 33)
addChild(151, 33)
addChild(90, 33)
addChild(152, 33)
addChild(91, 33)
addChild(153, 33)
addChild(92, 33)
addChild(154, 33)

# สารวัตรแขวงหาดใหญ่ = [ตอนหาดใหญ่ & ตอนหาดใหญ่ที่พัทลุง & ตอนรือเสาะที่ยะลา & ตอนยะลาที่สุไหงโกลก]
addChild(93, 34)
addChild(155, 34)
addChild(94, 34)
addChild(156, 34)
addChild(95, 34)
addChild(157, 34)
addChild(96, 34)
addChild(158, 34)

# สารวัตรแขวงฉะเชิงเทรา = [ตอนฉะเชิงเทรา & ตอนปราจีนบุรี & ตอนปราจีนบุรีที่อรัญประเทศ & ตอนองครักษ์ & ตอนองครักษ์ที่คลองสิบเก้า]
addChild(97, 35)
addChild(159, 35)
addChild(98, 35)
addChild(160, 35)
addChild(99, 35)
addChild(161, 35)
addChild(100, 35)
addChild(162, 35)
addChild(101, 35)
addChild(163, 35)

# สารวัตรแขวงศรีราชา = [ตอนศรีราชาที่ชลบุรี & ตอนศรีราชา & ​ตอนพลูตาหลวงที่บางละมุง & ตอนพลูตาหลวง]
addChild(102, 36)
addChild(164, 36)
addChild(103, 36)
addChild(165, 36)
addChild(104, 36)
addChild(166, 36)
addChild(105, 36)
addChild(167, 36)

# สารวัตรงานระบบข่ายชุมสาย = []

# สารวัตรงานระบบไฟฟ้าแสงสว่าง = []

# สารวัตรงานระบบส่งสัญญาณโทรคมนาคม = []

# สารวัตรงานระบบเสาสาย = []

# สารวัตรงานระบบวิทยุ = []

# สารวัตรงานวิชาการและอบรม = []

# สารวัตรงานมาตรฐานและตรวจสอบ = []

# สารวัตรงานวิจัยและสถิติ = []

# สารวัตรงานซ่อมบำรุงอิเล็กทรอนิกส์ = []


# print(len(TreePaths))

unique_ify = set() # Assumes that order does not matter

for data in TreePaths:

    unique_ify.add((data[0], data[1], data[2]))

for data in list(unique_ify):

    print("{}\t{}\t{}".format(data[0], data[1], data[2]))























# import json


# def has_children(obj_hierarchy):
#     '''
#     Function for check it has children ?
#     Input: 
#         obj_hierarchy:
#     Output:
#         obj_hierarchy['children']
#     '''
#     if "children" in obj_hierarchy:
#         print("has_children",obj_hierarchy['name'])
#         return obj_hierarchy['children']
#     return []


# # Read JSON File
# with open('/workdir/position_hierarchy.json') as f:
#     position_hierarchy_obj = json.load(f)

# count = 0
# print("ROOT -->", position_hierarchy_obj['name'])
# for posi_child in position_hierarchy_obj['children']:
#     print(">", posi_child['name'])
#     if "children" in posi_child:
#         for posi in position_hierarchy_obj:
#             print("In children", posi_child['children'])
#             has_children(posi_child['children'])
#     else:
#         print("Out children", posi_child['name'])
    
#     # if position_hierarchy_obj['children'] != 
#     # print(count)
#     # if count == 1:
#     #     break
#     # count = count + 1
